# FabricParamCutByHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricParamCutByHost Property
ParameterTypeId Class See Also
---
"Cut by Host Cover": Single Fabric Sheet is cut or not cut by the Host Cover.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricParamCutByHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricParamCutByHost As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricParamCutByHost {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace